In [1]:
import pandas as pd

In [2]:
a={ "Name":["zara","tara","karan"],
     "dept":["CSE","IT","CSE"],
      "id":["001","005","007"]}

In [4]:
df=pd.DataFrame(a)
df

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [10]:
#Apply function

df['Name'].apply(len)

0    4
1    4
2    5
Name: Name, dtype: int64

In [17]:

#To get a values in upper case using functions
def update_column(Name):
   return Name.upper()

In [18]:
df['Name'].apply(update_column)

0     ZARA
1     TARA
2    KARAN
Name: Name, dtype: object

In [22]:
#To get the values back to lower case using lambda function

df['Name']=df['Name'].apply(lambda x:x.lower())
df

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [25]:
#map

df.map(len)

   Name  dept  id
0     4     3   3
1     4     2   3
2     5     3   3

In [26]:
df.map(str.lower)

    Name dept   id
0   zara  cse  001
1   tara   it  005
2  karan  cse  007

In [27]:
df['Name'].map({'zara':'hara'})

0    hara
1     NaN
2     NaN
Name: Name, dtype: object

In [28]:
#Replace
df['id'].replace({'005':'013'})

0    001
1    013
2    007
Name: id, dtype: object

In [31]:
df['id']=df['id'].replace({'005':'013'})
df

    Name dept   id
0   zara  CSE  001
1   tara   IT  013
2  karan  CSE  007

In [33]:
#Adding Columns
df['dept']+ ' ' +df['id']

0    CSE 001
1     IT 013
2    CSE 007
dtype: object

In [35]:
df['section']=df['dept']+ ' ' +df['id']
df

    Name dept   id  section
0   zara  CSE  001  CSE 001
1   tara   IT  013   IT 013
2  karan  CSE  007  CSE 007

In [51]:
df.drop(index=2)

   Name dept
0  zara  CSE
1  tara   IT

In [54]:
#Sorting

In [55]:
#Sorting for two columns

In [56]:
a={ "Name":["zara","tara","karan"],
     "dept":["CSE","IT","CSE"],
      "id":["001","005","007"]}

In [57]:
df=pd.DataFrame(a)

In [58]:
df

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [59]:
df.sort_values(by=['id','dept'],ascending=False)

    Name dept   id
2  karan  CSE  007
1   tara   IT  005
0   zara  CSE  001

In [62]:
df.sort_values(by=['id','Name'],ascending=[True,True])

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [63]:
df.sort_values(by='dept')

    Name dept   id
0   zara  CSE  001
2  karan  CSE  007
1   tara   IT  005